ElicoftZ/Momuntum_Flipper_For_T_Embed/sdkconfig.defaults
# Target: ESP32-C6 (RISC-V, for Waveshare ESP32-C6-LCD-1.9)
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_singleapp_large.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp_large.csv"

# Bluetooth Low Energy for Bad USB BLE HID
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=8
CONFIG_BT_NIMBLE_MAX_CCCDS=8
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=4
# Use ESP-IDF's normal controller capacity. The previous one-activity cap
# prevented even basic advertising and left no headroom for coexistence tests.
CONFIG_BT_CTRL_BLE_MAX_ACT=6
# Legacy advertising/scanning is used throughout this firmware. Keep the
# unused BLE 5 extended scan/periodic-sync machinery out of the image and heap.
# CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT is not set

# Keep the 2.4 GHz arbiter enabled so WiFi and BLE can stay active together.
CONFIG_ESP_COEX_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# FreeRTOS configuration for Furi compatibility
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=3
CONFIG_FREERTOS_UNICORE=y
# Slot 0 is reserved by ESP-IDF pthread; Furi uses slot 1. Keep one spare so
# thread cleanup can never overwrite the pthread deletion callback.
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=3
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Heap
CONFIG_HEAP_TRACING_OFF=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Task watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# System
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FAT filesystem: enable Long File Names (stored on heap)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# NFC needs 3DES (felica, mf_ultralight)
CONFIG_MBEDTLS_DES_C=y

# WiFi "Update SD": HTTPS-Download ohne Server-Zertifikatsprüfung erlauben
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
# mbedTLS-Allokationen ins PSRAM (interner DRAM reicht mit WiFi nicht für den
# TLS-Handshake → sonst -0x7F00/-0x2880). Langsamer als intern, aber stabil;
# DYNAMIC_BUFFER + SPIRAM_TRY_ALLOCATE_WIFI_LWIP crashen den WiFi-Treiber.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
